---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotCopyWatchCurveBasedFixture
source: html/6f0d85cd-0b4f-02d7-7cdf-a8842a4dbfce.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotCopyWatchCurveBasedFixture Property

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyWatchCurveBasedFixture { get; }
```